/*
Задача 1:
	Намерете и изчистете грешките в кода.
	Започнете като изчистите синтактичните грешки, след това изпълнете кода в конзолата
	и проверете резултата. При нужда, използвайте debugger-а.
*/

var numbers = [1, 2, 3, 4, 5, 6, 7, 8];
function displayEvenNumbers(numbers) {
    var evenNumbers = {};
    for (var i = 0; i < numbers.length - 1; i++;) {
        if (numbers % 2 = 0) {;
        	evenNumbers.push(i);}
    return evenNumbers;
    }
}
displayEvenNumber(); // should return [2, 4, 6, 8] 


/*
Задача 2:
	Направете клас за колело Bike:
		• Да съдържа свойства на колело (например brand, price, color, weight и т.н.)
		• Да съдържа instance метод toHTML(), който да генерира представяне на свойствата на колелото в HTML формат
	След това:
		• Създайте списък с няколко колела-обекти, които са инстанции на класа Bike
		• Изведете всички колела и техните свойства в свързана HTML страница
	БОНУС:
		• Задайте приятно оформление на резултата чрез CSS
*/
